import pandas as pd
import matplotlib.pyplot as plt


data = [
    {"Товар": "Ноутбук", "Количество": 5, "Цена": 700, "Дата": "2024-02-01"},
    {"Товар": "Смартфон", "Количество": 8, "Цена": 500, "Дата": "2024-02-02"},
    {"Товар": "Планшет", "Количество": 4, "Цена": 300, "Дата": "2024-02-03"},
    {"Товар": "Монитор", "Количество": 6, "Цена": 200, "Дата": "2024-02-04"},
    {"Товар": "Наушники", "Количество": 10, "Цена": 50, "Дата": "2024-02-05"},
]

df = pd.DataFrame(data)

df["Общая сумма"] = df["Количество"] * df["Цена"]


df["Дата"] = pd.to_datetime(df["Дата"])


print("Общая сумма продаж:", df["Общая сумма"].sum())
print("Средняя цена товара:", df["Цена"].mean())
print("Максимальная продажа по сумме:", df["Общая сумма"].max())
print("Минимальная продажа по сумме:", df["Общая сумма"].min())

# Визуализация данных


plt.figure(figsize=(8, 4))
plt.bar(df["Товар"], df["Количество"], color="skyblue")
plt.xlabel("Товары")
plt.ylabel("Количество проданных единиц")
plt.title("Количество продаж по товарам")
plt.xticks(rotation=30)
plt.show()


plt.figure(figsize=(8, 4))
plt.plot(df["Дата"], df["Общая сумма"], marker="o", linestyle="-", color="red")
plt.xlabel("Дата")
plt.ylabel("Общая сумма продаж")
plt.title("Общая сумма продаж по дням")
plt.grid(True)
plt.show()
